ninjasstudio/micropython/ports/esp32/machine_pwm.c
// This called from Ctrl-D soft reboot
void machine_pwm_deinit_all(void) {
    MP_PRN(MP_PRN_TRACE, "Machine_pwm_deinit_all()");
    if (pwm_inited) {
        for (int mode = 0; mode < LEDC_SPEED_MODE_MAX; ++mode) {
            for (int channel = 0; channel < LEDC_CHANNEL_MAX; ++channel) {
                pwm_deinit(mode, channel);
            }
        }
        pwm_inited = false;
    }
}

STATIC void configure_channel(machine_pwm_obj_t *self) {
    ledc_channel_config_t cfg = {
        .channel = self->channel,
        //.duty = (1 << timers[self->mode][self->timer].duty_resolution) / 2, // 50%
        .duty = self->duty_u16,
        .gpio_num = self->pin,
        .intr_type = LEDC_INTR_DISABLE,
        .speed_mode = self->mode,
        .timer_sel = self->timer,
        #if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 4, 0)
        .flags.output_invert = self->output_invert,
        #endif
    };
    MP_PRN(3, "Configure_channel() dr=%d d=%u p=%d m=%d c=%d t=%d ", timers[self->mode][self->timer].duty_resolution, cfg.duty, self->pin, self->mode, self->channel, self->timer);
    check_esp_err(ledc_channel_config(&cfg));
}

#define pwm_is_active(self) { MP_PRN(MP_PRN_INFO, "%s || Pwm_is_active() || %d || %s", __FUNCTION__, __LINE__, __FILE__); pwm_is_active_(self); }

STATIC void pwm_is_active_(machine_pwm_obj_t *self) {
    if (!self->active) {
        mp_raise_msg(&mp_type_RuntimeError, MP_ERROR_TEXT("PWM is inactive"));
    }
}

// Calculate the duty parameters based on an ns value
STATIC int ns_to_duty(machine_pwm_obj_t *self, int ns) {
    ledc_timer_config_t *timer = &timers[self->mode][self->timer];
    int64_t duty = ((int64_t)ns * UI_MAX_DUTY * timer->freq_hz + 500000000LL) / 1000000000LL;
    if ((ns > 0) && (duty == 0)) {
        duty = 1;
    } else if (duty > UI_MAX_DUTY) {
        duty = UI_MAX_DUTY;
    }
    return duty;
}

STATIC int duty_to_ns(machine_pwm_obj_t *self, int duty) {
    ledc_timer_config_t *timer = &timers[self->mode][self->timer];
    int64_t ns = ((int64_t)duty * 1000000000LL + (int64_t)timer->freq_hz * UI_MAX_DUTY / 2) / ((int64_t)timer->freq_hz * UI_MAX_DUTY);
    return ns;
}

#define get_duty_raw(self) ledc_get_duty(self->mode, self->channel)

STATIC uint32_t get_duty_u16(machine_pwm_obj_t *self) {
    int resolution = timers[self->mode][self->timer].duty_resolution;
    if (resolution <= UI_RES_16_BIT) {
        return get_duty_raw(self) << (UI_RES_16_BIT - resolution);
    } else {
        return get_duty_raw(self) >> (resolution - UI_RES_16_BIT);
    }
}

STATIC uint32_t get_duty_u10(machine_pwm_obj_t *self) {
    return get_duty_u16(self) >> (UI_RES_16_BIT - PWM_RES_10_BIT); // Scale down from 16 bit to 10 bit resolution
}

STATIC uint32_t get_duty_ns(machine_pwm_obj_t *self) {
    return duty_to_ns(self, get_duty_u16(self));
}

STATIC void set_duty_u16(machine_pwm_obj_t *self, int duty) {
    if ((duty < 0) || (duty > UI_MAX_DUTY)) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("duty_u16 must be from 0 to %d"), UI_MAX_DUTY);
    }

    ledc_timer_config_t *timer = &timers[self->mode][self->timer];
    int channel_duty;
    if (timer->duty_resolution <= UI_RES_16_BIT) {
        channel_duty = duty >> (UI_RES_16_BIT - timer->duty_resolution);
    } else {
        channel_duty = duty << (timer->duty_resolution - UI_RES_16_BIT);
    }
    int max_duty = (1 << timer->duty_resolution) - 1;
    if (channel_duty < 0) {
        channel_duty = 0;
    } else if (channel_duty > max_duty) {
        channel_duty = max_duty;
    }

    /*
    #if SOC_LEDC_TIMER_BIT_WIDE_NUM < 16
    int channel_duty = duty >> (UI_RES_16_BIT - HIGHEST_PWM_RES);
    #else
    int channel_duty = duty >> (HIGHEST_PWM_RES - UI_RES_16_BIT);
    #endif
    */
    //int channel_duty = duty >> UI_RESOLUTION_SHIFT;

    check_esp_err(ledc_set_duty(self->mode, self->channel, channel_duty));
    check_esp_err(ledc_update_duty(self->mode, self->channel));

    /*
    // Bug: Sometimes duty is not set right now.
    // Not a bug. It's a feature. The duty is applied at the beginning of the next signal period.
    // Bug: It has been experimentally established that the duty is setted during 2 signal periods, but 1 period is expected.
    // See https://github.com/espressif/esp-idf/issues/7288
    #if MP_PRN_LEVEL >= MP_PRN_WARNING
    //ledc_timer_config_t *timer = &timers[self->mode][self->timer];
    if (duty != get_duty_u16(self)) {
        MP_PRN(MP_PRN_WARNING, "Set_duty_u16(%u), get_duty_u16()=%u, duty=%d, duty_resolution=%d, freq_hz=%d", duty, get_duty_u16(self), duty, timer->duty_resolution, timer->freq_hz);
        ets_delay_us(2 * 1000000 / timer->freq_hz);
        if (duty != get_duty_u16(self)) {
            MP_PRN(MP_PRN_WARNING, "Set_duty_u16(%u), get_duty_u16()=%u, duty=%d, duty_resolution=%d, freq_hz=%d", duty, get_duty_u16(self), duty, timer->duty_resolution, timer->freq_hz);
        }
    }
    #endif
    */

    self->duty_x = HIGHEST_PWM_RES;
    self->duty = duty;
    self->duty_u16 = duty;
}

STATIC void set_duty_u10(machine_pwm_obj_t *self, int duty) {
    if ((duty < 0) || (duty > MAX_DUTY_U10)) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("duty must be from 0 to %u"), MAX_DUTY_U10);
    }
    set_duty_u16(self, duty << (UI_RES_16_BIT - PWM_RES_10_BIT));
    self->duty_x = PWM_RES_10_BIT;
    self->duty = duty;
}

STATIC void set_duty_ns(machine_pwm_obj_t *self, int ns) {
    if ((ns < 0) || (ns > duty_to_ns(self, UI_MAX_DUTY))) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("duty_ns must be from 0 to %d ns"), duty_to_ns(self, UI_MAX_DUTY));
    }
    set_duty_u16(self, ns_to_duty(self, ns));
    self->duty_x = -HIGHEST_PWM_RES;
    self->duty = ns;
}

STATIC void set_duty(machine_pwm_obj_t *self) {
    MP_PRN(3, "Set_duty() duty_x=%d, duty=%d", self->duty_x, self->duty);
    if (self->duty_x == HIGHEST_PWM_RES) {
        set_duty_u16(self, self->duty);
    } else if (self->duty_x == PWM_RES_10_BIT) {
        set_duty_u10(self, self->duty);
    } else if (self->duty_x == -HIGHEST_PWM_RES) {
        set_duty_ns(self, self->duty);
    }
}

// Set timer frequency
STATIC void set_freq(machine_pwm_obj_t *self, unsigned int freq) {
    ledc_timer_config_t *timer = &timers[self->mode][self->timer];
    if (timer->freq_hz != freq) {
        // Find the highest bit resolution for the requested frequency
        unsigned int i = LEDC_APB_CLK_HZ; // 80 MHz
        #if SOC_LEDC_SUPPORT_REF_TICK
        if (freq < EMPIRIC_FREQ) {
            i = LEDC_REF_CLK_HZ; // 1 MHz
        }
        #endif

        #if ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(4, 4, 0)
        // original code
        i /= freq;
        #else
        // See https://github.com/espressif/esp-idf/issues/7722
        int divider = (i + freq / 2) / freq; // rounded
        if (divider == 0) {
            divider = 1;
        }
        float f = (float)i / divider; // actual frequency
        if (f <= 1.0) {
            f = 1.0;
        }
        i = (unsigned int)roundf((float)i / f);
        #endif

